Catalogs/ТК_ГрафикиТСД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ТК_ГрафикиТСД</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТК_ВидыПериодичностиГрафикаТСД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДниНедели</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидГрафика</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТК_ВидыЗадачТСД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураЭлементы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеОтборов</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЧисло</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТоварныеГруппы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТорговыеОбъекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТорговаяПлощадка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТорговыеПлощадки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВключаяНижестоящие</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТоварныеЭлементы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ТК_ВидыПериодичностиГрафикаТСД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТК_ВидыПериодичностиГрафикаТСД</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Еженедельно</Name>
					<Comment>Раз в неделю</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазВДвеНедели</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазВТриНедели</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазВЧетыреНедели</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаДату</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаДатуМесяца</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТК_ВидыЗадачТСД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТК_ВидыЗадачТСД</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВернутьПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Инвентаризация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВерификацияЦенников</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТБД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГрафикИнвентаризаций</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГрафикТНП</Name>
					<Comment>Товар непригодный к продаже</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Уведомление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоказанияЭлектроСчетчиков</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Comment>Код производителя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Полное наименование, например, для печати</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование2</Name>
					<Comment>Локализованное наименование 2</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазоваяЕдиницаИзмерения</Name>
					<Comment>Базовая единица измерения номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяЕдиницаИзмерения</Name>
					<Comment>Основная единица измерения номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмеренияУпаковки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмеренияЯщиков</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Comment>Тип номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Comment>Вид номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТоварнаяМарка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТоварныеМарки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>Ставка НДС по умолчанию для оформления документов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаПроисхождения</Name>
					<Comment>Страна происхождения по умолчанию</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокХраненияТовара</Name>
					<Comment>Срок хранения товара (в днях)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ширина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Высота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Глубина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаЦенообразования</Name>
					<Comment>Группа ценообразования</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыЦенообразования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодУКТВЭД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторУКТВЭД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АкцизГруппа</Name>
					<Comment>Группа акциза</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыАкциза</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДляБухгалтерии</Name>
					<Comment>Группа для бухгалтерии</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатурыПланирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипНоменклатурыПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользованиеХарактеристик</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьПФ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойШтрихКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойАртикул</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИндикатива</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТК_ТипыИндикатива</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Крепость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеRB</Name>
					<Comment>Наименование  для Radio Beacon</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентВыгрузки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТК_Производитель</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодакцизныйТовар</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеАктивный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИД_Товара</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставНабора</Name>
					<Comment>Состав набора</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>Номенклатура</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>Характеристика номенклатуры</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособРасчетаЦены</Name>
							<Comment>Способ расчета цены реализации</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыРасчетаЦены</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ТК_ГрафикиТСД/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда 
		ПолучитьНастройкиКомпоновщикаПоУмолчанию();
	КонецЕсли;
	
	УстановитьВидимостьНаСервере();
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ВидГрафика","Доступность",Объект.Ссылка.Пустая());
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"Переодичность","Доступность",Объект.Ссылка.Пустая());

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	//Отборы
	СхемаКомпоновкиДанных = ПолучитьОбщийМакет("СхемаКомпоновкиОтбораНоменклатуры");	
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, ЭтаФорма.УникальныйИдентификатор)));	
	
	НастройкиОтборов = ТекущийОбъект.ХранилищеОтборов.Получить();
	ЗагрузитьНастройкиПоУмолчанию = НастройкиОтборов = Неопределено;
	
	
	Если Не ЗагрузитьНастройкиПоУмолчанию Тогда 
		Попытка
			КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиОтборов);
		Исключение
			ЗагрузитьНастройкиПоУмолчанию = Истина;
		КонецПопытки;
	КонецЕсли;
	
	Если ЗагрузитьНастройкиПоУмолчанию Тогда 
		КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);			
	КонецЕсли;
	

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ХранилищеОтборов = Новый ХранилищеЗначения(КомпоновщикНастроек.ПолучитьНастройки(), Новый СжатиеДанных(9));

КонецПроцедуры


&НаКлиенте
Процедура ДниНеделиПриИзменении(Элемент)
		
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДниНедели(Результат,Переодичность)	Экспорт
	Объект.ДниНедели = Результат;
КонецПроцедуры

&НаКлиенте
Процедура ДниНеделиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Оповещение = Новый ОписаниеОповещения("ПолучитьДниНедели",ЭтотОбъект,Ложь);
	ОткрытьФорму("ОбщаяФорма.ДниНедели", Новый Структура("Периодичность,ДниНедели", Ложь, СокрЛП(Элементы.ДниНедели.ТекстРедактирования)), ЭтотОбъект,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	СтандартнаяОбработка=Ложь;
КонецПроцедуры



&НаКлиенте
Процедура ПереодичностьПриИзменении(Элемент)
	

	Если Объект.Периодичность = ПредопределенноеЗначение("Перечисление.ТК_ВидыПериодичностиГрафикаТСД.НаДату") Тогда
		Элементы.Дата.Видимость = Истина;
		Элементы.ДниНедели.Видимость = Ложь;
		Элементы.ДатаЧисло.Видимость = Ложь;
		
	ИначеЕсли Объект.Периодичность = ПредопределенноеЗначение("Перечисление.ТК_ВидыПериодичностиГрафикаТСД.НаДатуМесяца") Тогда
		Элементы.Дата.Видимость = Ложь;
		Элементы.ДниНедели.Видимость = Ложь;
		Элементы.ДатаЧисло.Видимость = Истина;
		
	Иначе
		Элементы.Дата.Видимость = Ложь;
		Элементы.ДниНедели.Видимость = Истина;
		Элементы.ДатаЧисло.Видимость = Ложь;
		
	КонецЕсли;

	
КонецПроцедуры

&НаСервере
Процедура ПереодичностьПриИзмененииФрагмент()
	
КонецПроцедуры


&НаКлиенте
Процедура НоменклатураЭлементыПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ГруппаТоварыЭлементы","Видимость",Объект.НоменклатураЭлементы);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ГруппаТоварныеГруппы","Видимость",НЕ Объект.НоменклатураЭлементы);
	Объект.ТоварныеГруппы.Очистить();
	Объект.ТоварныеЭлементы.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидГрафикаПриИзменении(Элемент)
	
	Если Объект.ВидГрафика = ПредопределенноеЗначение("Перечисление.ТК_ВидыЗадачТСД.ТБД") Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ГруппаОтборы","Видимость",Истина);
		ОбщегоНазначенияТККлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,"ГруппаТоварыЭлементы,ГруппаТоварныеГруппы,НоменклатураЭлементы","Видимость",Ложь);
	ИначеЕсли Объект.ВидГрафика	= ПредопределенноеЗначение("Перечисление.ТК_ВидыЗадачТСД.ПоказанияЭлектроСчетчиков") Тогда

		ОбщегоНазначенияТККлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,"НоменклатураЭлементы,ГруппаТоварныеГруппы,ГруппаОтборы","Видимость",Ложь)
		
	Иначе
		
		Если Объект.ВидГрафика = ПредопределенноеЗначение("Перечисление.ТК_ВидыЗадачТСД.ВерификацияЦенников") Тогда
			Объект.НоменклатураЭлементы = Ложь;
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"НоменклатураЭлементы","Видимость",Ложь);
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"НоменклатураЭлементы","Видимость",Истина);
		КонецЕсли;
			
		ГрафикНаДату  = ?(Объект.Периодичность = ПредопределенноеЗначение("Перечисление.ТК_ВидыПериодичностиГрафикаТСД.НаДату"),Истина,Ложь);
		
		Элементы.Дата.Видимость = ГрафикНаДату;
		Элементы.ДниНедели.Видимость = НЕ ГрафикНаДату;
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ГруппаТоварыЭлементы","Видимость",Объект.НоменклатураЭлементы);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ГруппаТоварныеГруппы","Видимость",НЕ Объект.НоменклатураЭлементы);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ГруппаОтборы","Видимость",Ложь);
	

	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура УстановитьВидимостьНаСервере()
	//ГрафикНаДату  = ?(Объект.Периодичность = ПредопределенноеЗначение("Перечисление.ТК_ВидыПериодичностиГрафикаТСД.НаДату"),Истина,Ложь);
	//
	//Элементы.Дата.Видимость = ГрафикНаДату;
	//Элементы.ДниНедели.Видимость = НЕ ГрафикНаДату;
	
	
	Если Объект.Периодичность = ПредопределенноеЗначение("Перечисление.ТК_ВидыПериодичностиГрафикаТСД.НаДату") Тогда
		ОбщегоНазначенияТККлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,"Дата","Видимость",Истина);
		ОбщегоНазначенияТККлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,"ДниНедели,ДатаЧисло","Видимость",Ложь);

	ИначеЕсли Объект.Периодичность = ПредопределенноеЗначение("Перечисление.ТК_ВидыПериодичностиГрафикаТСД.НаДатуМесяца") Тогда		
		ОбщегоНазначенияТККлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,"Дата,ДниНедели","Видимость",Ложь);
		ОбщегоНазначенияТККлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,"ДатаЧисло","Видимость",Истина);

	Иначе
		ОбщегоНазначенияТККлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,"ДниНедели","Видимость",Истина);
		ОбщегоНазначенияТККлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,"ДатаЧисло,Дата","Видимость",Ложь);

	КонецЕсли;

	
	
	Если Объект.ВидГрафика = Перечисления.ТК_ВидыЗадачТСД.ТБД Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ГруппаОтборы","Видимость",Истина);
		ОбщегоНазначенияТККлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,"ГруппаТоварыЭлементы,ГруппаТоварныеГруппы,НоменклатураЭлементы","Видимость",Ложь);
	ИначеЕсли Объект.ВидГрафика = Перечисления.ТК_ВидыЗадачТСД.ПоказанияЭлектроСчетчиков Тогда
		
		ОбщегоНазначенияТККлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,"НоменклатураЭлементы,ГруппаТоварныеГруппы,ГруппаОтборы","Видимость",Ложь)

	Иначе
		Если Объект.ВидГрафика = Перечисления.ТК_ВидыЗадачТСД.ВерификацияЦенников Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"НоменклатураЭлементы","Видимость",Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ГруппаТоварыЭлементы","Видимость",Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ГруппаТоварныеГруппы","Видимость",Истина);
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ГруппаТоварыЭлементы","Видимость",Объект.НоменклатураЭлементы);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ГруппаТоварныеГруппы","Видимость",НЕ Объект.НоменклатураЭлементы);
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ГруппаОтборы","Видимость",Ложь);
	КонецЕсли;

	
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьНастройкиКомпоновщикаПоУмолчанию()
	
	СхемаКомпоновкиДанных = ПолучитьОбщийМакет("СхемаКомпоновкиОтбораНоменклатуры");			
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, ЭтаФорма.УникальныйИдентификатор)));	
 
	Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);			

КонецПроцедуры

&НаКлиенте
Процедура ВидГрафикаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ВидГрафика","Доступность",Объект.Ссылка.Пустая());
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"Переодичность","Доступность",Объект.Ссылка.Пустая());

	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьПоОтбору(Команда)
	
	Если Модифицированность Тогда
		Сообщить("Сначало необходимо записать график");
		Возврат;
	КонецЕсли;
	
	Табдок = СвормироватьТабдокПоОтборуНаСервере();
	
КонецПроцедуры


&НаСервере
Функция  СвормироватьТабдокПоОтборуНаСервере()
	Табдок = Новый ТабличныйДокумент;
	МассивТоваров  = Справочники.ТК_ГрафикиТСД.ПолучитьМассивТоваров(Объект.Ссылка);
	Возврат Табдок;
КонецФункции

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Отказ = ОбщегоНазначенияТК.ПроверитьЗаполнениеНастроекОтчета(КомпоновщикНастроек);
	
КонецПроцедуры


&НаКлиенте
Процедура ПодборТовара(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПодборНоменклатурыПослеЗакрытия", ЭтаФорма,"Подбор");
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь); 
	ПараметрыФормы.Вставить("РежимВыбора", 		  Истина); 
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина); 
	Если Объект.НоменклатураЭлементы  Тогда
		ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора",ПараметрыФормы,ЭтотОбъект,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		ОткрытьФорму("Справочник.Номенклатура.ФормаВыбораГруппы",ПараметрыФормы,ЭтотОбъект,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли; 
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Для Каждого СтрокаМассива Из ВыбранноеЗначение Цикл
		Если ЗначениеЗаполнено(СтрокаМассива) Тогда
			Если ИсточникВыбора.ИмяФормы = "Справочник.Номенклатура.ФормаВыбора" Тогда
				Объект.ТоварныеЭлементы.Добавить().Номенклатура = СтрокаМассива;
			Иначе				
				Объект.ТоварныеГруппы.Добавить().Номенклатура = СтрокаМассива;	
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла; 	
КонецПроцедуры

&НаКлиенте
Процедура ПодборНоменклатурыПослеЗакрытия(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
КонецПроцедуры 


&НаКлиенте
Процедура Заполнить(Команда)
	
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьИзТекстовогоПоляПродолжение", ЭтаФорма, Неопределено);
	
	ПоказатьВводСтроки(
		ОписаниеОповещения, 
		"", 
		НСтр("ru = 'Введите артикула товаров с новой строки или через запятую'; uk = 'Введіть артикули товарів з нової строки або через кому'"),
		0,
		Истина);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзТекстовогоПоляПродолжение(Текст, ДопПараметры) Экспорт 
	
	Если Не ЗначениеЗаполнено(Текст) Тогда 
		Возврат;
	КонецЕсли;

	ЗагрузитьИзТекстовогоПоляНаСервере(Текст);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИзТекстовогоПоляНаСервере(Текст)
	
	НовТекст = СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими(",.-;", Текст, Символы.ПС);	
	МассивСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(НовТекст, Символы.ПС);
	//СписокНоменклатуры = Новый СписокЗначений;
	
	Для Каждого Стр Из МассивСтрок Цикл 
		текСтр = СокрЛП(Стр);
		
		Если ПустаяСтрока(текСтр) Тогда 
			Продолжить;
		ИначеЕсли Не СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(текСтр) Тогда 
			ОбщегоНазначения.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Неверный формат артикула ""%1""'; uk = 'Невірний формат артикулу ""%1""'"),
					текСтр));
		Иначе
			Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", текСтр);	
			Если Не Номенклатура.Пустая() Тогда 
				Объект.ТоварныеЭлементы.Добавить().Номенклатура = Номенклатура;
			Иначе
				ОбщегоНазначения.СообщитьПользователю(
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Не найдена номенклатура с артикулом ""%1""'; uk = 'Не знайдена номенклатура з артикулом ""%1""'"),
						текСтр));					
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
